ua1arn/hftrx/lib/Middlewares/ST/STM32_USB_Host_Library/Core/Src/usbh_core.c
	#if (USBH_USE_OS == 1)
			osMessagePut ( phost->os_event, USBH_PORT_EVENT, 0);
	#endif
		phost->gState = HOST_DEV_WAIT_FOR_ATTACHMENT;
		break;

	case HOST_DELAY:
		if (-- phost->gPushTicks == 0)
			phost->gState = phost->gPushState;
		break;

	case HOST_DEV_WAIT_FOR_ATTACHMENT:
		//USBH_UsrLog(PSTR("USBH_Process: HOST_DEV_WAIT_FOR_ATTACHMENT\n"));
		break;

	case HOST_DEV_BEFORE_ATTACHED:
		// в этом состоянии игнорируем disconnect - возникает при старте устройства с установленным USB устройством
		  //USBH_UsrLog(PSTR("USBH_Process: HOST_DEV_BEFORE_ATTACHED\n"));
		/* Wait for 100 ms after Reset */
		USBH_ProcessDelay(phost, HOST_DEV_ATTACHED_WAITSPEED, 100);
		break;

	case HOST_DEV_ATTACHED_WAITSPEED:
		// Ожидаем пока не завершится процесс выясненеия скорости, на которой может работать device.
		if (USBH_LL_GetSpeedReady(phost))
			phost->gState = HOST_DEV_ATTACHED;
		else
			;//dbg_putchar('^');
		break;

	case HOST_DEV_ATTACHED:
		  //USBH_UsrLog(PSTR("USBH_Process: HOST_DEV_ATTACHED\n"));
		/* после таймаута */
		phost->device.speed = USBH_LL_GetSpeed(phost);

		phost->gState = HOST_ENUMERATION;

		phost->Control.pipe_out = USBH_AllocPipe(phost, 0x00);
		phost->Control.pipe_in  = USBH_AllocPipe(phost, 0x80);


		/* Open Control pipes */
		USBH_OpenPipe(phost,
			phost->Control.pipe_in,
			0x80,
			phost->device.address,
			phost->device.speed,
			USBH_EP_CONTROL,
			phost->Control.pipe_size);

		/* Open Control pipes */
		USBH_OpenPipe(phost,
			phost->Control.pipe_out,
			0x00,
			phost->device.address,
			phost->device.speed,
			USBH_EP_CONTROL,
			phost->Control.pipe_size);

#if (USBH_USE_OS == 1)
		osMessagePut ( phost->os_event, USBH_PORT_EVENT, 0);
#endif

		break;

	case HOST_ENUMERATION:
		//USBH_UsrLog(PSTR("USBH_Process: HOST_ENUMERATION\n"));
		/* Check for enumeration status */
		if (USBH_HandleEnum(phost) == USBH_OK)
		{
			/* The function shall return USBH_OK when full enumeration is complete */
			USBH_UsrLog(PSTR("Enumeration done.\n"));
			phost->device.current_interface = 0;
			if (phost->device.DevDesc.bNumConfigurations == 1)
			{
				USBH_UsrLog(PSTR("This device has only 1 configuration.\n"));
				phost->gState = HOST_SET_CONFIGURATION;
			}
			else
			{
				phost->gState = HOST_INPUT;
			}

		}
		break;

  case HOST_INPUT:
	  //USBH_UsrLog(PSTR("USBH_Process: HOST_INPUT\n"));
    {
      /* user callback for end of device basic enumeration */
      if (phost->pUser != NULL)
      {
        phost->pUser(phost, HOST_USER_SELECT_CONFIGURATION);
        phost->gState = HOST_SET_CONFIGURATION;

#if (USBH_USE_OS == 1)
        osMessagePut ( phost->os_event, USBH_STATE_CHANGED_EVENT, 0);
#endif
      }
    }
    break;

  case HOST_SET_CONFIGURATION:
	  //USBH_UsrLog(PSTR("USBH_Process: HOST_SET_CONFIGURATION\n"));
    /* set configuration */
    if (USBH_SetCfg(phost, phost->device.CfgDesc.bConfigurationValue) == USBH_OK)
    {
      phost->gState  = HOST_CHECK_CLASS;
      USBH_UsrLog(PSTR("Default configuration set.\n"));

    }
    break;

	case HOST_CHECK_CLASS:
		// Если USBH_GetActiveClass(phost) == 0x01 - работаем с составным устройством.
		//USBH_UsrLog(PSTR("USBH_Process: HOST_CHECK_CLASS (0x%02X)\n"), (unsigned) USBH_GetActiveClass(phost));
		if (phost->ClassNumber == 0)
		{
			USBH_UsrLog(PSTR("No Class has been registered.\n"));
			phost->gState = HOST_ABORT_STATE;
		}
		else
		{
			uint_fast8_t idx = 0;
			phost->pActiveClass = NULL;

			for (idx = 0; idx < phost->ClassNumber; idx ++)
			{
				if (phost->pClass [idx] != NULL && phost->pClass [idx]->ClassCode == USBH_GetActiveClass(phost))
				{
					phost->pActiveClass = phost->pClass [idx];
					break;	// или должен был последний из встретив
				}
			}

			if (phost->pActiveClass != NULL)
			{
				if (phost->pActiveClass->Init(phost) == USBH_OK)
				{
					phost->gState  = HOST_CLASS_REQUEST;
					USBH_UsrLog(PSTR("%s class started.\n"), phost->pActiveClass->Name);

					/* Inform user that a class has been activated */
					phost->pUser(phost, HOST_USER_CLASS_SELECTED);
				}
				else
				{
					phost->gState = HOST_ABORT_STATE;
					USBH_UsrLog(PSTR("Device not supporting %s class.\n"), phost->pActiveClass->Name);
				}
			}
			else
			{
				phost->gState  = HOST_ABORT_STATE;
				USBH_UsrLog(PSTR("No registered class for this device.\n"));
			}
		}

#if (USBH_USE_OS == 1)
		osMessagePut ( phost->os_event, USBH_STATE_CHANGED_EVENT, 0);
#endif
    break;

  case HOST_CLASS_REQUEST:
	  //USBH_UsrLog(PSTR("USBH_Process: HOST_CLASS_REQUEST\n"));
    /* process class standard control requests state machine */
    if (phost->pActiveClass != NULL)
    {
      status = phost->pActiveClass->Requests(phost);

      if(status == USBH_OK)
      {
        phost->gState  = HOST_CLASS;
      }
    }
    else
    {
      phost->gState  = HOST_ABORT_STATE;
      USBH_UsrLog(PSTR("Invalid Class Driver.\n"));

#if (USBH_USE_OS == 1)
    osMessagePut ( phost->os_event, USBH_STATE_CHANGED_EVENT, 0);
#endif
    }
    break;

  case HOST_CLASS:
	  //USBH_UsrLog(PSTR("USBH_Process: HOST_CLASS\n"));
    /* process class state machine */
    if (phost->pActiveClass != NULL)
    {
      phost->pActiveClass->BgndProcess(phost);
    }
    break;

  case HOST_DEV_DISCONNECTED :
	  //USBH_UsrLog(PSTR("USBH_Process: HOST_DEV_DISCONNECTED\n"));
    DeInitStateMachine(phost);

    /* Re-Initilaize Host for new Enumeration */
    if (phost->pActiveClass != NULL)
    {
      phost->pActiveClass->DeInit(phost);
      phost->pActiveClass = NULL;
    }
    break;

  case HOST_ABORT_STATE:
	  //USBH_UsrLog(PSTR("USBH_Process: HOST_ABORT_STATE\n"));
    break;

  default :
	  //TP();
	  //USBH_UsrLog(PSTR("USBH_Process: default\n"));
    break;
  }
 return USBH_OK;
}


/**
  * @brief  USBH_HandleEnum
  *         This function includes the complete enumeration process
  * @param  phost: Host Handle
  * @retval USBH_Status
  */
static USBH_StatusTypeDef USBH_HandleEnum(USBH_HandleTypeDef *phost)
{
  USBH_StatusTypeDef Status = USBH_BUSY;
  USBH_StatusTypeDef ReqStatus = USBH_BUSY;

